/*
*版权  学生管理系统
*文件名：tooler.c
*作者：wxh
*日期：2013/02/22
*修改：新建
**/

/**************头文件包含**************/
#include "stu.h"
#include "tea.h"
/**************头文件包含**************/


/**************结构定义 宏定义*********/

/**************结构定义 宏定义*********/

/**************全局变量定义************/

/**************全局变量定义************/

/***************局部函数申明***********/

/***************局部函数申明***********/

/***************函数实现******************/



int printErr()
{
	printf("您的输入有错误，任意键继续...\n");
	getchar();
}
int read_stu(stu_list *head)
{
}
read_tea(tea_list *head)
{
}
int save_stu(stu_list head)
{
}
int save_tea(tea_list head)
{
}



