/*
*文件名:
*描述：
*作者：
*日期：
*修改记录：
*
*/
/**************************头文件包含***********************************/
#include <stdio.h>
/**************************头文件包含***********************************/


/**************************结构体定义***********************************/
/**************************结构体定义***********************************/


/**************************宏定义***********************************/
/**************************宏定义***********************************/

/**************************函数声明***********************************/
float function(int num1,float num2);//函数的声明
void  function1();
/**************************函数声明***********************************/


/**************************函数实现***********************************/

/*
函数调用的过程实质就是参数传递的一个过程
调用函数通过参数将数据传递给被调用函数
被调用函数通过返回值将数据传递给调用函数

*/
/*
int main()
{
    function1();
	return 0;
}
*/
int main()//调用函数
{
		int a;
		float b,result;
		printf("请输入两个加数：\n");
		scanf("%d%f",&a,&b);
		result=function(a,b);//函数调用  a,b实参  int function(int,int)
//		printf("result=%f\n",result);
        function(5,result);
   		return 0;
}

void  function1()//实际项目最好不要这样设计，保证函数与函数之间有数据传递
{
		int num1;
		float num2,result;
		scanf("%d%f",&num1,&num2);
		result=num1+num2;
		printf("result=%f\n",result);
}
float function(int num1,float num2)//函数的定义   num1,num2形参    被调用函数
{
		float  result;
		result=num1+num2;
		return result;
}
