/************************************************
*file name:
*function:定义一个数组存储4个学生的语文、数学、英语成绩，
*定义一个数组指针将数据写入数组，打印外层数组每个元素的起始地址，
*内层数组每个元素的起始地址以及每个元素对应的数据
*author:
**************************************************/
#include<stdio.h>
void main()
{
	float gre[4][3];
	float (*p)[3];
	int i,j;
	p = gre;
	printf("请输入四个学生的成绩:\n");
	for(i=0;i<4;i++)
	{
		printf("请输入第%d个学生的语文、数学、英语成绩:\n",i+1);
		for(j=0;j<3;j++)
		{
			scanf("%f",*(p+i)+j);
		
		}
	
	}
	for(i=0;i<4;i++)//外层元素地址
	{
		printf("&gre[%d] = %p\n",i,p+i);
	}
	for(i=0;i<4;i++)//内层元素地址
	{
		for(j=0;j<3;j++)
		{
			printf("&gre[%d][%d] = %p\n",i,j,*(p+i)+j);
		
		}
	
	}
	for(i=0;i<4;i++)// 元素值
	{
		for(j=0;j<3;j++)
		{
			printf("gre[%d][%d] = %.2f\n",i,j,*(*(p+i)+j));
		
		}
	
	}
	
	

}
