/************************************************
*file name:
*function:数组指针

*1 指向所有数组元素：
int a[5]; int *p = a;
//a 表示首元素起始地址，&a表示整个数组的起始地址，两者地址相同，但意义不同

*2 指向整个数组：
int a[3][5];int (*p)[5]; p = a/a+1/a+2 // &a[0]/&a[1]/&a[2]

//a 表示二维数组外层第一个元素的起始地址   a[0]表示内层数组第一个元素的首地址 a[0]+j表示内层数组第j个元素的首地址
a+1 表示二维数组外层第二个元素的起始地址   a[1]表示内层数组第二个元素的首地址 a[1]+j表示内层数组第j个元素的首地址
a = &a[0] a+1 = &a[1]

&a表示整个二维数组的起始地址 &a 与a、&a[0]、a[0]、&a[0][0]值相同 但含义不同


*author:
*************************************************/
#include<stdio.h>
#define M 3
#define N 2

void main()
{
	int a[M][N]; 
	int (*p)[N];
	int i,j;
	p = a; //&a[0]
	for(i=0;i<M;i++)
	{
		for(j=0;j<N;j++)
			scanf("%d",a[i]+j);//&a[i][j]
	}

	for(i=0;i<M;i++)
	{
		printf("p+%d = %p\n",i,p+i);
	
	}

	for(i=0;i<M;i++)
	{
		for(j=0;j<N;j++)
		{
			printf("*(p+%d)+%d = %p\n",i,j,*(p+i)+j);
		
		}
	
	}
	for(i=0;i<M;i++)
	{
		for(j=0;j<N;j++)
		{
			printf("*(*(p+%d)+%d) = %d\n",i,j,*(*(p+i)+j));
		
		}
	
	}


}
