/*
*版权  学生管理系统
*文件名：main.c
*作者：wxh
*日期：2013/02/22
*修改：新建
**/

/**************头文件包含**************/
#include "common.h"
#include "menu.h"
/**************头文件包含**************/


/**************结构定义 宏定义*********/

/**************结构定义 宏定义*********/

/**************全局变量定义************/

/**************全局变量定义************/

/***************局部函数申明***********/

/***************局部函数申明***********/

/***************函数实现******************/
int printSysHead()
{
	printf("\t\t\t***************************\n");
	printf("\t\t\t**********welcome**********\n");
	printf("\t\t\t***************************\n");
	printf("\n\n");
}
int main()
{
	
	return sysMenu();
}









